src/Documents/ВводПоказателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ВводПоказателей</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЗначенияПоказателей</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтандартОтчетности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтандартыОтчетности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОтчетности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОтчетности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Множитель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрядностьДробнойЧасти</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Показатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Показатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Показатели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПоказателя</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ТипЗначенияПоказателя</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/ЗначенияПоказателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияПоказателей</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеПоказателя</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ТипЗначенияПоказателя</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтандартОтчетности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтандартыОтчетности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Показатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Показатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Documents/ВводПоказателей/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр ЗначенияПоказателей
	Движения.ЗначенияПоказателей.Записывать = Истина;
	Для Каждого СтрокаТабЧасти Из Показатели Цикл
		Движение = Движения.ЗначенияПоказателей.Добавить();
		Движение.Период = Дата;
		Движение.Периодичность = Периодичность;
		Движение.Контрагент = Контрагент;
		Движение.СтандартОтчетности = СтандартОтчетности;
		Движение.Показатель = СтрокаТабЧасти.Показатель;
		Движение.ЗначениеПоказателя = СтрокаТабЧасти.ЗначениеПоказателя * Множитель;
	КонецЦикла;
		
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
	ДатаНачПериода = ОбщегоНазначенияКлиентСервер.ПолучитьДатуНачалаПериода(Дата, Периодичность);
	Если Дата <> ДатаНачПериода Тогда
		Дата = ДатаНачПериода;
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(Множитель) Тогда
		Множитель = 1;
	КонецЕсли;
	
	// АВТОПРОВЕРКА
	ЗначенияПоказателей = Новый Соответствие;
	Для Каждого СтрокаТабЧасти Из ЭтотОбъект.Показатели Цикл
		ЗначенияПоказателей.Вставить(СтрокаТабЧасти.Показатель, СтрокаТабЧасти.ЗначениеПоказателя);
	КонецЦикла; 
	Для Каждого СтрокаТабЧасти Из ЭтотОбъект.Показатели Цикл
		РезультатПроверки = ОбщегоНазначенияСервер.ПроверитьЗначениеПоказателя(ЗначенияПоказателей, СтрокаТабЧасти.Показатель);
		Если РезультатПроверки <> Неопределено
			И (НЕ РезультатПроверки) Тогда
			СообщениеОбОшибке = "Для показателя " + СтрокаТабЧасти.Показатель + " не выполняется условие проверки """ + СтрокаТабЧасти.Показатель.ФормулаПроверки + "!";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОбОшибке,,,, Отказ);
		КонецЕсли; 
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ПроверяемыеРеквизиты.Добавить("Контрагент");
	ПроверяемыеРеквизиты.Добавить("Периодичность");
	
КонецПроцедуры
